witalis3/UA3REO-DDC-Transceiver/STM32/WOLF-X1/Src/front_unit.c
	static uint32_t fu_debug_lasttime = 0;
	uint16_t buttons_count = sizeof(PERIPH_FrontPanel_Buttons) / sizeof(PERIPH_FrontPanel_Button);
	uint32_t mcp3008_value = 0;

	//process buttons
	for (uint16_t b = 0; b < buttons_count; b++)
	{
		PERIPH_FrontPanel_Button *button = &PERIPH_FrontPanel_Buttons[b];
//check disabled ports
#ifdef HRDW_MCP3008_1
		if (button->port == 1 && !FRONTPanel_MCP3008_1_Enabled)
			continue;
#endif
#ifdef HRDW_MCP3008_2
		if (button->port == 2 && !FRONTPanel_MCP3008_2_Enabled)
			continue;
#endif
#ifdef HRDW_MCP3008_3
		if (button->port == 3 && !FRONTPanel_MCP3008_3_Enabled)
			continue;
#endif
		
// get state from ADC MCP3008 (10bit - 1024values)
#ifdef HRDW_MCP3008_1
		if (button->port == 1) {
			mcp3008_value = 0;
			mcp3008_value += FRONTPANEL_ReadMCP3008_Value(button->channel, 1);
			mcp3008_value += FRONTPANEL_ReadMCP3008_Value(button->channel, 1);
			mcp3008_value += FRONTPANEL_ReadMCP3008_Value(button->channel, 1);
			mcp3008_value /= 3;
		} else
#endif
#ifdef HRDW_MCP3008_2
		if (button->port == 2) {
			mcp3008_value = 0;
			mcp3008_value += FRONTPANEL_ReadMCP3008_Value(button->channel, 2);
			mcp3008_value += FRONTPANEL_ReadMCP3008_Value(button->channel, 2);
			mcp3008_value += FRONTPANEL_ReadMCP3008_Value(button->channel, 2);
			mcp3008_value /= 3;
		} else
#endif
#ifdef HRDW_MCP3008_3
		if (button->port == 3) {
			mcp3008_value = 0;
			mcp3008_value += FRONTPANEL_ReadMCP3008_Value(button->channel, 3);
			mcp3008_value += FRONTPANEL_ReadMCP3008_Value(button->channel, 3);
			mcp3008_value += FRONTPANEL_ReadMCP3008_Value(button->channel, 3);
			mcp3008_value /= 3;
		} else
#endif
			continue;

		if (TRX.Debug_Type == TRX_DEBUG_BUTTONS)
		{
			static uint8_t fu_gebug_lastchannel = 255;
			if ((HAL_GetTick() - fu_debug_lasttime > 500 && fu_gebug_lastchannel != button->channel) || fu_debug_lasttime == 0)
			{
				println("F_UNIT: port ", button->port, " channel ", button->channel, " value ", mcp3008_value);
				fu_gebug_lastchannel = button->channel;
			}
		}

		//TANGENT
		if (button->type == FUNIT_CTRL_TANGENT)
		{
			//Yaesu MH-48
			if(CALIBRATE.TangentType == TANGENT_MH48)
				for (uint16_t tb = 0; tb < (sizeof(PERIPH_FrontPanel_TANGENT_MH48) / sizeof(PERIPH_FrontPanel_Button)); tb++)
					if(button->channel == PERIPH_FrontPanel_TANGENT_MH48[tb].channel)
						FRONTPANEL_CheckButton(&PERIPH_FrontPanel_TANGENT_MH48[tb], mcp3008_value);
		}
		else
			FRONTPANEL_CheckButton(button, mcp3008_value); //other buttons / resistors
	}

	if (TRX.Debug_Type == TRX_DEBUG_BUTTONS)
	{
		if (HAL_GetTick() - fu_debug_lasttime > 500)
		{
			println("");
			fu_debug_lasttime = HAL_GetTick();
		}
	}

	HRDW_SPI_Locked = false;
}

void FRONTPANEL_CheckButton(PERIPH_FrontPanel_Button *button, uint16_t mcp3008_value)
{
	// AF_GAIN
	if (button->type == FUNIT_CTRL_AF_GAIN)
	{
		TRX.Volume = (uint16_t)(MAX_VOLUME_VALUE - mcp3008_value);
		if (TRX.Volume < 50)
			TRX.Volume = 0;
	}

	// RIT / XIT or IF Gain
	if (button->type == FUNIT_CTRL_RIT_XIT)
	{
		if (TRX.RIT_Enabled)
		{
			int_fast16_t TRX_RIT_old = TRX_RIT;
			TRX_RIT = (int_fast16_t)(((1023.0f - mcp3008_value) * TRX.RIT_INTERVAL * 2 / 1023.0f) - TRX.RIT_INTERVAL);
			if (TRX_RIT_old != TRX_RIT)
			{
				TRX_setFrequency(CurrentVFO->Freq, CurrentVFO);
				uint16_t LCD_bw_trapez_stripe_pos_new = LAYOUT->BW_TRAPEZ_POS_X + LAYOUT->BW_TRAPEZ_WIDTH / 2;
				LCD_bw_trapez_stripe_pos_new = LCD_bw_trapez_stripe_pos_new + (int16_t)((float32_t)(LAYOUT->BW_TRAPEZ_WIDTH * 0.9f) / 2.0f * ((float32_t)TRX_RIT / (float32_t)TRX.RIT_INTERVAL));
				if (abs(LCD_bw_trapez_stripe_pos_new - LCD_bw_trapez_stripe_pos) > 2)
				{
					LCD_bw_trapez_stripe_pos = LCD_bw_trapez_stripe_pos_new;
					LCD_UpdateQuery.StatusInfoGUI = true;
				}
			}
			TRX_XIT = 0;
		}
		else if (TRX.XIT_Enabled)
		{
			int_fast16_t TRX_XIT_old = TRX_XIT;
			TRX_XIT = (int_fast16_t)(((1023.0f - mcp3008_value) * TRX.XIT_INTERVAL * 2 / 1023.0f) - TRX.XIT_INTERVAL);
			if (TRX_XIT_old != TRX_XIT && !TRX_on_TX)
			{
				TRX_setFrequency(CurrentVFO->Freq, CurrentVFO);
				uint16_t LCD_bw_trapez_stripe_pos_new = LAYOUT->BW_TRAPEZ_POS_X + LAYOUT->BW_TRAPEZ_WIDTH / 2;
				LCD_bw_trapez_stripe_pos_new = LCD_bw_trapez_stripe_pos_new + (int16_t)((float32_t)(LAYOUT->BW_TRAPEZ_WIDTH * 0.9f) / 2.0f * ((float32_t)TRX_XIT / (float32_t)TRX.XIT_INTERVAL));
				if (abs(LCD_bw_trapez_stripe_pos_new - LCD_bw_trapez_stripe_pos) > 2)
				{
					LCD_bw_trapez_stripe_pos = LCD_bw_trapez_stripe_pos_new;
					LCD_UpdateQuery.StatusInfoGUI = true;
				}
			}
			TRX_RIT = 0;
		}
		else
		{
			TRX_RIT = 0;
			TRX_XIT = 0;
			TRX.IF_Gain = (uint8_t)(CALIBRATE.IF_GAIN_MIN + ((1023.0f - mcp3008_value) * (float32_t)(CALIBRATE.IF_GAIN_MAX - CALIBRATE.IF_GAIN_MIN) / 1023.0f));
		}
	}
	
	//ENC2_SW
	if (button->type == FUNIT_CTRL_ENC2SW)
	{
		bool frontunit_enc2_state_now = true;
		if (mcp3008_value >= button->tres_min && mcp3008_value < button->tres_max)
			frontunit_enc2_state_now = false;
		FRONTPANEL_check_ENC2SW(frontunit_enc2_state_now);
	}
	
	// PTT
	if (button->type == FUNIT_CTRL_PTT)
	{
		static bool frontunit_ptt_state_prev = false;
		bool frontunit_ptt_state_now = false;
		if (mcp3008_value >= button->tres_min && mcp3008_value < button->tres_max)
			frontunit_ptt_state_now = true;
		if (frontunit_ptt_state_prev != frontunit_ptt_state_now)
		{
			TRX_ptt_soft = frontunit_ptt_state_now;
			TRX_ptt_change();
			frontunit_ptt_state_prev = frontunit_ptt_state_now;
		}
	}
	
	//BUTTONS
	if (button->type == FUNIT_CTRL_BUTTON)
	{
		//println(mcp3008_value, " ", button->tres_min, " ", button->tres_max);
		
		//set state
		if (mcp3008_value >= button->tres_min && mcp3008_value < button->tres_max)
		{
			TRX_Inactive_Time = 0;
			button->state = true;
			if (TRX.Debug_Type == TRX_DEBUG_BUTTONS)
				println("Button pressed: port ", button->port, " channel ", button->channel, " value: ", mcp3008_value);
		}
		else
			button->state = false;

		//check state
		if ((button->prev_state != button->state) && button->state)
		{
			button->start_hold_time = HAL_GetTick();
			button->afterhold = false;
		}

		//check hold state
		if ((button->prev_state == button->state) && button->state && ((HAL_GetTick() - button->start_hold_time) > KEY_HOLD_TIME) && !button->afterhold)
		{
			button->afterhold = true;
			if (!LCD_systemMenuOpened || button->work_in_menu)
			{
				if (!LCD_window.opened)
				{
					if (button->holdHandler != NULL)
					{
						CODEC_Beep();
						button->holdHandler(button->parameter);
					}
				}
				else
				{
					LCD_closeWindow();
				}
			}
		}

		//check click state
		if ((button->prev_state != button->state) && !button->state && ((HAL_GetTick() - button->start_hold_time) < KEY_HOLD_TIME) && !button->afterhold && !TRX.Locked)
		{
			if (!LCD_systemMenuOpened || button->work_in_menu)
			{
				if (!LCD_window.opened)
				{
					if (button->clickHandler != NULL)
					{
						CODEC_Beep();
						button->clickHandler(button->parameter);
					}
				}
				else
				{
					LCD_closeWindow();
				}
			}
		}

		//save prev state
		button->prev_state = button->state;
	}
	
	//DEBUG BUTTONS
	if (button->type == FUNIT_CTRL_BUTTON_DEBUG)
	{
		char str[64] = {0};
		sprintf(str, "%d: %d       ", button->channel, mcp3008_value);
		LCDDriver_printText(str, 10, 200 + button->channel * 20, COLOR_RED, BG_COLOR, 2);
	}
}

static uint16_t FRONTPANEL_ReadMCP3008_Value(uint8_t channel, uint8_t adc_num)
{
	uint8_t outData[3] = {0};
	uint8_t inData[3] = {0};
	uint16_t mcp3008_value = 0;

	outData[0] = 0x18 | channel;
	bool res = false;
	#ifdef HRDW_MCP3008_1
	if(adc_num == 1) res = HRDW_FrontUnit_SPI(outData, inData, 3, false);
	#endif
	#ifdef HRDW_MCP3008_2
	if(adc_num == 2) res = HRDW_FrontUnit2_SPI(outData, inData, 3, false);
	#endif
	#ifdef HRDW_MCP3008_3
	if(adc_num == 3) res = HRDW_FrontUnit3_SPI(outData, inData, 3, false);
	#endif
	if (res == false)
		return 65535;
	mcp3008_value = (uint16_t)(0 | ((inData[1] & 0x3F) << 4) | (inData[2] & 0xF0 >> 4));

	return mcp3008_value;
}
